InformationRegisters/МинимальнаяСтоимостьПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МинимальнаяСтоимостьПродукции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОпределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияМинимальнойЦеныНаПродукцию</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНаценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокНаценкиМинимальнойЦеныНаПродукцию</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПараметровПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПараметровПродукции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрПродукции</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ДокументУстановкиЦены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериалов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныМатериаловИндивидуальные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериаловИндивидуальные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦены</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦеныСФотопечатью</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаценкаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыОпределенияСтоимостиПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияСтоимостиПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПараметрам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоШаблону</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыЦен</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ПорядокОкругленияСтоимостиПроизводимыхПотолков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОкруглятьВБольшуюСторонуСтоимостьПроизводимыхПотолков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылочныйВидЦены</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатуры</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНаПродукцию</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНаУслугиПроизводства</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценкиОтБП1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЦеныКомпании/Ext/Module.bsl
Функция ПолучитьЦенуНоменклатуры(Знач Номенклатура, Знач ХарактеристикаНоменклатуры, Знач ЕдиницаИзмерения, Знач Количество,
			     	  Знач Дата, Знач ВидЦены, Знач Валюта,
					  Знач Организация = Неопределено, Знач Подразделение = Неопределено,
					  Знач Контрагент = Неопределено, Знач ДоговорКонтрагента = Неопределено) Экспорт

	Цена = 0;
	ПараметрыПродукции = Новый Структура;
	
	Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Номенклатура) Тогда
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "ВидНоменклатуры, Потолок_ПлощадьФотопечати");
		ФактураПотолка = Справочники.Номенклатура.ПолучитьОсновнуюФактуруИЦветПотолка(Номенклатура);
		
		ПараметрыПродукции.Вставить("ВидНоменклатуры", РеквизитыНоменклатуры.ВидНоменклатуры);
		ПараметрыПродукции.Вставить("СФотопечатью", НЕ (РеквизитыНоменклатуры.Потолок_ПлощадьФотопечати = 0));
		ПараметрыПродукции.Вставить("Фактура", ФактураПотолка.ПродукцияФактура);
		ПараметрыПродукции.Вставить("ЦветФактур", ФактураПотолка.ПродукцияЦвет);
		Цена = ПолучитьЦенуПродукции(ПараметрыПродукции, Дата, ВидЦены, Валюта, Контрагент, ДоговорКонтрагента);
		
	ИначеЕсли Справочники.ВидыНоменклатуры.ЭтоНоменклатураПродукция(Номенклатура) Тогда
		
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "ВидНоменклатуры, ВидПродукции.СпособОпределенияСтоимости, Шаблон");
		ПараметрыПродукции.Вставить("ВидНоменклатуры", РеквизитыНоменклатуры.ВидНоменклатуры);
		
		Если РеквизитыНоменклатуры.ВидПродукцииСпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоШаблону Тогда
			ШаблонПродукции = РеквизитыНоменклатуры.Шаблон;			
			ПараметрыПродукции.Вставить("Шаблон", ШаблонПродукции);
			Цена = ПолучитьЦенуПродукции(ПараметрыПродукции, Дата, ВидЦены, Валюта, Контрагент, ДоговорКонтрагента);
			
			ДанныеМинимальнойСтоимости = РегистрыСведений.МинимальнаяСтоимостьПродукции.ПолучитьМинимальнуюСтоимость(Дата, ВидЦены, Валюта, Организация, Подразделение, ШаблонПродукции, , РеквизитыНоменклатуры.ВидНоменклатуры);
			Если ДанныеМинимальнойСтоимости.Стоимость > 0 И Количество > 0
				И Цена * Количество < ДанныеМинимальнойСтоимости.Стоимость Тогда
				Цена = ДанныеМинимальнойСтоимости.Стоимость / Количество;
			КонецЕсли;
			
		ИначеЕсли РеквизитыНоменклатуры.ВидПродукцииСпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоПараметрам Тогда
			// #16971
			Цена = РегистрыСведений.ЦеныПараметровПродукции.ПолучитьЦену(Номенклатура, Дата, ВидЦены, Валюта, Контрагент, ДоговорКонтрагента);
			
		ИначеЕсли РеквизитыНоменклатуры.ВидПродукцииСпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоНоменклатуре Тогда
			// #16971
			ПараметрыПродукции.Вставить("Номенклатура", Номенклатура);
			ПараметрыПродукции.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
			Цена = ПолучитьЦенуПродукции(ПараметрыПродукции, Дата, ВидЦены, Валюта, Контрагент, ДоговорКонтрагента);

		КонецЕсли;
	Иначе
		Если ЕдиницаИзмерения = Неопределено Тогда
			ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Номенклатура);
		КонецЕсли;
		Цена = РегистрыСведений.ЦеныНоменклатуры.ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, 
																		   Дата, ВидЦены, Валюта, Контрагент, ДоговорКонтрагента);
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции

#Область ЦеныПродукции

Функция ПолучитьЦенуПродукцииВВалюте(ПараметрыПродукции, Знач ДатаЦены, Знач ВидЦены, Знач Валюта,
									Знач Контрагент = Неопределено, Знач ДоговорКонтрагента = Неопределено) Экспорт
									
	// ПараметрыПродукции: СФотопечатью = Ложь, Знач ДатаЦены, Знач ВидЦены, Знач ФактураШаблон, Знач ЦветФактуры = Неопределено, Знач Валюта, Знач ВидНоменклатуры = Неопределено								
	СФотопечатью = Ложь;
	Если ПараметрыПродукции.Свойство("СФотопечатью") Тогда
		СФотопечатью = ПараметрыПродукции.СФотопечатью;	
	КонецЕсли;
	ВидНоменклатуры = Неопределено;
	Если ПараметрыПродукции.Свойство("ВидНоменклатуры") Тогда
		ВидНоменклатуры = ПараметрыПродукции.ВидНоменклатуры;	
	КонецЕсли;
	Если ВидНоменклатуры = Неопределено Тогда
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.Потолок;
	КонецЕсли;
	Фактура = Неопределено;
	Если ПараметрыПродукции.Свойство("Фактура") Тогда
		Фактура = ПараметрыПродукции.Фактура;	
	КонецЕсли;
	ЦветФактуры = Неопределено;
	Если ПараметрыПродукции.Свойство("ЦветФактуры") Тогда
		ЦветФактуры = ПараметрыПродукции.ЦветФактуры;	
	КонецЕсли;
	Шаблон = Неопределено;
	Если ПараметрыПродукции.Свойство("Шаблон") Тогда
		Шаблон = ПараметрыПродукции.Шаблон;	
	КонецЕсли;
	Номенклатура = Неопределено;
	Если ПараметрыПродукции.Свойство("Номенклатура") Тогда
		Номенклатура = ПараметрыПродукции.Номенклатура;	
	КонецЕсли;
	ЕдиницаИзмерения = Неопределено;
	Если ПараметрыПродукции.Свойство("ЕдиницаИзмерения") Тогда
		ЕдиницаИзмерения = ПараметрыПродукции.ЕдиницаИзмерения;	
	КонецЕсли;
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА НЕ &СФотопечатью
	|			ТОГДА ЦеныМатериаловСрезПоследних.Цена
	|		ИНАЧЕ ЦеныМатериаловСрезПоследних.ЦенаСФотопечатью
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|			&ДатаЦены,
	//++#7256
	|			ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(&ВидЦены КАК Справочник.ВидыЦен).СсылочныйВидЦены = ИСТИНА
	|						ТОГДА ВидЦен = ВЫРАЗИТЬ(&ВидЦены КАК Справочник.ВидыЦен).ВидЦеныНаПродукцию
	|					ИНАЧЕ ВидЦен = &ВидЦены
	|				КОНЕЦ
	//|			ВидЦен = &ВидЦены
	//--#7256
	|				И Валюта = &Валюта
	|				И ВидНоменклатуры = &ВидНоменклатуры
	|				И ВЫБОР 
	|					КОГДА &ОтборПоШаблону ТОГДА Шаблон = &Шаблон 
	|					КОГДА &ОтборПоНоменклатуре ТОГДА Номенклатура = &Номенклатура И ЕдиницаИзмерения = &ЕдиницаИзмерения 
	|				  	ИНАЧЕ Фактура = &Фактура И ЦветФактуры = &ЦветФактуры
	|                 КОНЕЦ
	|	) КАК ЦеныМатериаловСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаЦены",			КонецДня(ДатаЦены));
	Запрос.УстановитьПараметр("ВидЦены",			ВидЦены);
	Запрос.УстановитьПараметр("Валюта",				Валюта);
	Запрос.УстановитьПараметр("ВидНоменклатуры",	ВидНоменклатуры);
	
	Запрос.УстановитьПараметр("Фактура",			Фактура);
	Запрос.УстановитьПараметр("ЦветФактуры",		ЦветФактуры);
	Запрос.УстановитьПараметр("СФотопечатью",		СФотопечатью);
	
	Запрос.УстановитьПараметр("ОтборПоШаблону",		НЕ Шаблон = Неопределено);
	Запрос.УстановитьПараметр("Шаблон",				Шаблон);
	
	Запрос.УстановитьПараметр("ОтборПоНоменклатуре",НЕ Номенклатура = Неопределено);
	Запрос.УстановитьПараметр("Номенклатура",		Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",	ЕдиницаИзмерения);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Цена;
	КонецЕсли;
	
	//#7256
	Если НЕ Контрагент = Неопределено ИЛИ ДоговорКонтрагента = Неопределено Тогда
		Если Контрагент = Неопределено Тогда
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		Если ДоговорКонтрагента = Неопределено Тогда
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		Результат = ПолучитьИндивидуальнуюЦенуПродукции(Результат, ВидНоменклатуры, Фактура, ЦветФактуры, СФотопечатью, Шаблон, Номенклатура, ЕдиницаИзмерения,
														ДатаЦены, Валюта, Контрагент, ДоговорКонтрагента);
	КонецЕсли;
													
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЦенуПродукцииВВалютеУчета(ПараметрыПродукции, Знач ДатаЦены, Знач ВидЦены,
	                                      Знач Контрагент = Неопределено, Знач ДоговорКонтрагента = Неопределено) Экспорт
										  
	Валюта = ПолучитьФункциональнуюОпцию("ВалютаУчета");									  
	Возврат ПолучитьЦенуПродукцииВВалюте(ПараметрыПродукции, ДатаЦены, ВидЦены, Валюта, 
									     Контрагент, ДоговорКонтрагента);
	
КонецФункции

Функция ПолучитьЦенуПродукции(ПараметрыПродукции, ДатаЦены, ВидЦены, ВалютаДокумента,
	                          Знач Контрагент = Неопределено, Знач ДоговорКонтрагента = Неопределено) Экспорт
							  
	Результат = 0;
	ЦенаНоменклатуры = ПолучитьЦенуПродукцииВВалюте(ПараметрыПродукции, КонецДня(ДатаЦены), ВидЦены, ВалютаДокумента, Контрагент, ДоговорКонтрагента);
	
	Если НЕ ЦенаНоменклатуры = 0 Тогда
		Возврат ЦенаНоменклатуры;
	КонецЕсли;
		
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	ОсновнаяВалютаПересчетаЦены = Константы.ОсновнаяВалютаПересчетаЦены.Получить();
	
	//++ №12971 по новому
	// 1. Если не нашли цену по валюте документа и задана валюта пересчета, ищем прайс в валюте пересчета
	//	(если нашли, то ставим цену в валюте документа по курсу к валюте пересчета)
	Если ЗначениеЗаполнено(ОсновнаяВалютаПересчетаЦены) Тогда
		
		ЦенаНоменклатуры = ПолучитьЦенуПродукцииВВалюте(ПараметрыПродукции, КонецДня(ДатаЦены), ВидЦены, ОсновнаяВалютаПересчетаЦены, Контрагент, ДоговорКонтрагента);
		
		Если НЕ ЦенаНоменклатуры = 0 Тогда
			
			ДатаКурса = ДатаЦены;
			
			Если ДатаКурса = Дата(1,1,1) Тогда
				ДатаКурса = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Возврат РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ОсновнаяВалютаПересчетаЦены, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// 2. Если не нашли цену по валюте пересчета, то ищем прайс в валюте учета (если валюта документа отличается от валюты учёта)
	//	(если нашли, то ставим цену в валюте документа по курсу к валюте учета)
	Если НЕ ВалютаДокумента = ВалютаУчета Тогда
		
		ЦенаНоменклатуры = ПолучитьЦенуПродукцииВВалютеУчета(ПараметрыПродукции, КонецДня(ДатаЦены), ВидЦены, Контрагент, ДоговорКонтрагента);
		
		Если НЕ ЦенаНоменклатуры = 0 Тогда
			
			ДатаКурса = ДатаЦены;
			
			Если ДатаКурса = Дата(1,1,1) Тогда
				ДатаКурса = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Возврат РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВалютаУчета, ВалютаДокумента, ДатаКурса, ЦенаНоменклатуры);
			
		КонецЕсли;
		
	КонецЕсли;
	//-- №12971 по новому
	
	Возврат ЦенаНоменклатуры;
	
КонецФункции

//#7256
Функция ПолучитьИндивидуальнуюЦенуПродукции(ТекущаяЦена, ВидНоменклатуры, Фактура, ЦветФактуры, СФотопечатью, Шаблон, Номенклатура, ЕдиницаИзмерения, 
											ДатаЦены, Валюта,
											Знач Контрагент, Знач ДоговорКонтрагента)
	Результат = ТекущаяЦена;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеЦены") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА НЕ &СФотопечатью
		|			ТОГДА ВЫБОР
		|					КОГДА ЦеныИндивидуальныеСрезПоследних.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|						ТОГДА ЦеныИндивидуальныеСрезПоследних.Цена
		|					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) + ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) / 100 * ЦеныИндивидуальныеСрезПоследних.Наценка КАК ЧИСЛО(15, 2))
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЦеныИндивидуальныеСрезПоследних.ВидЦеныСФотопечатью = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|					ТОГДА ЦеныИндивидуальныеСрезПоследних.ЦенаСФотопечатью
		|				ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) + ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) / 100 * ЦеныИндивидуальныеСрезПоследних.НаценкаСФотопечатью КАК ЧИСЛО(15, 2))
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ЦеныИндивидуальныеСрезПоследних.Отменена КАК Отменена
		|ИЗ
		|	РегистрСведений.ЦеныМатериаловИндивидуальные.СрезПоследних(
		|			&ДатаЦены,
		|			Контрагент = &Контрагент
		|				И ДоговорКонтрагента = &ДоговорКонтрагента
		|				И ВидНоменклатуры = &ВидНоменклатуры
		|				И Валюта = &Валюта
		|				И ВЫБОР
		|					КОГДА &ОтборПоШаблону ТОГДА Шаблон = &Шаблон 
		|					КОГДА &ОтборПоНоменклатуре ТОГДА Номенклатура = &Номенклатура И ЕдиницаИзмерения = &ЕдиницаИзмерения 
		|				  	ИНАЧЕ Фактура = &Фактура И ЦветФактуры = &ЦветФактуры
		|				  КОНЕЦ
		|	) КАК ЦеныИндивидуальныеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(
		|				&ДатаЦены,
		|				ВидНоменклатуры = &ВидНоменклатуры
		|					И Валюта = &Валюта
		|					И ВЫБОР 
		|						КОГДА &ОтборПоШаблону ТОГДА Шаблон = &Шаблон 
		|						КОГДА &ОтборПоНоменклатуре ТОГДА Номенклатура = &Номенклатура И ЕдиницаИзмерения = &ЕдиницаИзмерения 
		|				  		ИНАЧЕ Фактура = &Фактура И ЦветФактуры = &ЦветФактуры
		|				  	  КОНЕЦ
		|		) КАК ЦеныСрезПоследних
		|		ПО ЦеныИндивидуальныеСрезПоследних.ВидНоменклатуры = ЦеныСрезПоследних.ВидНоменклатуры
		|			И ЦеныИндивидуальныеСрезПоследних.Фактура = ЦеныСрезПоследних.Фактура
		|			И ЦеныИндивидуальныеСрезПоследних.ЦветФактуры = ЦеныСрезПоследних.ЦветФактуры
		|			И ЦеныИндивидуальныеСрезПоследних.Шаблон = ЦеныСрезПоследних.Шаблон 		
		|			И ЦеныИндивидуальныеСрезПоследних.Номенклатура = ЦеныСрезПоследних.Номенклатура
		|			И ЦеныИндивидуальныеСрезПоследних.ЕдиницаИзмерения = ЦеныСрезПоследних.ЕдиницаИзмерения
		|			И (ВЫБОР
		|				КОГДА &СФотопечатью
		|					ТОГДА ЦеныИндивидуальныеСрезПоследних.ВидЦеныСФотопечатью = ЦеныСрезПоследних.ВидЦен
		|				ИНАЧЕ ЦеныИндивидуальныеСрезПоследних.ВидЦены = ЦеныСрезПоследних.ВидЦен
		|			КОНЕЦ)";
		
		Запрос.УстановитьПараметр("ДатаЦены",			КонецДня(ДатаЦены));
		Запрос.УстановитьПараметр("Контрагент",			Контрагент);
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
		
		Запрос.УстановитьПараметр("ВидНоменклатуры",	ВидНоменклатуры);
		Запрос.УстановитьПараметр("Валюта",				Валюта);
		
		Запрос.УстановитьПараметр("Фактура",			Фактура);
		Запрос.УстановитьПараметр("ЦветФактуры",		ЦветФактуры);
		Запрос.УстановитьПараметр("СФотопечатью",		СФотопечатью);
		
		Запрос.УстановитьПараметр("ОтборПоШаблону",		НЕ Шаблон = Неопределено);
		Запрос.УстановитьПараметр("Шаблон",				Шаблон);
		
		Запрос.УстановитьПараметр("ОтборПоНоменклатуре",НЕ Номенклатура = Неопределено);
		Запрос.УстановитьПараметр("Номенклатура",		Номенклатура);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения",	ЕдиницаИзмерения);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если НЕ Выборка.Отменена Тогда
				Результат = Выборка.Цена;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
